package task1

// Что такое GRQ и LRQ, и зачем они нужны?
// GRQ — глобальная очередь всех горутин.
// LRQ — локальная очередь у каждого P.
// Планировщик сначала берёт из LRQ, чтобы избежать гонки за GRQ.

// ------------------------------------------------------------------------------

// Что означают G, M, P в Go?
// G — goroutine
// M — machine (системный поток)
// P — processor (логический процессор Go, связывающий G и M)

// ------------------------------------------------------------------------------

// Как устроена работа планировщика Go?
// Планировщик использует модель GMP:
// У каждого P есть своя очередь (LRQ).
// Если LRQ пуста, проверяется GRQ или используется work-stealing.
// Блокировки тредов (syscall) решаются через handoff.
// Долгоживущие горутины вытесняются через preemption и Sysmon.

// ------------------------------------------------------------------------------

// Что делает handoff?
// Handoff переназначает P новому M, если текущий M заблокирован на syscall. Это позволяет P не простаивать.

// ------------------------------------------------------------------------------

// Что делает Sysmon?
// Фоновый монитор:
// Обнаруживает долгие syscalls.
// Инициирует вытеснение (preemption).
// Следит за Netpoller и возвращает готовые горутины в очередь.

// ------------------------------------------------------------------------------

// Как указать количество процессоров (P)?
// С помощью runtime.GOMAXPROCS(n), где n — количество логических процессоров.

// ------------------------------------------------------------------------------

// Сколько памяти потребляет горутина?
// Обычно от 2 до 4 КБ на старте. Стек динамически расширяется при необходимости.

// ------------------------------------------------------------------------------

// Чем горутина отличается от потока ОС?
// Горутины управляются Go runtime, а не ядром ОС. Они используют меньше памяти (2 КБ в начале)
